Repository: comparepywebframework/ComparePyWebFrameworks
Catalog: compare_py_web_frameworks/locale/*/LC_MESSAGES/django.po
Languages: pl

source: ComparePyWebFrameworks
pl: PorównajFrameworkiWebPythona

source: Rendering Template
pl: Renderowanie szablonu

source: Inserting to database
pl: Wprowadzanie danych do bazy danych

source: External API Call
pl: Wywołanie zewnętrznego API

source: Serialize JSON
pl: Serializacja JSON

source: Measurements
pl: Pomiary

source: 10 Records
pl: 10 rekordów

source: Last measurement Flask
pl: Ostatni pomiar Flask

source: Last measurement Django
pl: Ostatni pomiar Django

source: Last measurement Pyramid
pl: Ostatni pomiar Pyramid

source: Total measurements:
pl: Całkowita liczba pomiarów:

source: Average Time
pl: Średni czas

source: 50 Records
pl: 50 Rekordów

source: 100 Records
pl: 100 Rekordów

source: Django is a free open source framework designed to create complex websites. The Django Software Foundation is responsible for its development. It was founded in 2005 and since then its popularity has been constantly growing. It is widely used on the market in such organizations as Mozilla, Instagram, Bitubcket.
pl: Django jest to darmowy otwarto źródłowy framework przeznaczony do tworzenia złożonych serwisów internetowych. Za jego rozwój odpowiedzialna jest organizacja non-profit Django Software Foundation powstał on w 2005 roku i od tamtej pory jego popularność ciągle rośnie. Jest szeroko używany na rynku w takich organizacjach jak Mozilla, Instagram, Bitubcket.

source: The main goal of Django is to simplify the creation of complex applications that require the use of a database. Provided with many reusable components that are useful when creating applications such as the database administrator panel, which simplifies the process of software development.
pl: Głównym celem Django jest uproszczenie tworzenia złożonych aplikacji wymagających użycia bazy danych. Dostarcza on wielu reużywalnych komponentów, które przydają się przy tworzeniu takich aplikacji jak na przykład panel adminsitratora bazy danych, który upraszcza proces tworzenia oprogramowania.

source: Django supports the MVC Model - View - Kontroller architecture The model is responsible for the ORM (Object Relational Mapper) which is a bridge between data models written using Python and a relational database. Behind the view is the system associated with the processing of HTTP requests and the template generation system. The controller in the case of Django is a URL dispatcher, which controls the display of appropriate templates based on the given URL.
pl: Django wspiera architekturę MVC Model – Widok – Kontroller (ang. Model – View – Controller) Za model odpowiedzialny jest ORM (ang. Object Relational Mapper) który stanowi pomost pomiędzy modelami danych napisanymi z użyciem języka Python a relacyjną bazą danych. Za widok odpowiada system związany z przetwarzaniem żądań HTTP oraz system generowania szablonów. Kontrolerem zaś w przypadku Django jest dyspozytor URL (ang. URL Dispatcher), który steruje wyświetlaniem odpowiednich szablonów na podstawie podanego adresu URL.

source: Django also includes:
pl: W skład Django wchodzi również:

source: Server for debugging and testing
pl: Serwer służący do debugowania i testowania

source: A template generation system that has some of the concepts related to object-oriented programming like inheritance.
pl: System generowania szablonów, który posiada w sobie część koncepcji związanych z programowaniem obiektowym jak dziedziczenie.

source: A system for serializing objects to JSON objects
pl: System do serializacji obiektów do postacji obiektów JSON

source: A system supporting the creation of applications translated into different languages
pl: System wspomagający tworzenie aplikacji tłumaczonych na różne języki

source: Interface for unit tests
pl: Interfejs do tworzenia testów jednostkowych

source: The most important functions included in the basic distribution:
pl: Najważniejsze funkcje zawarte w podstawowej dystrybucji:

source: User authorization system
pl: System autentykacji użytkowników

source: The database administrator panel visible in Figure 1.
pl: Panel adminstratora bazy danych widoczny na Rys 1.

source: Built-in security for the most popular attacks like SQL injection and password cracking.
pl: Wbudowane zabezpieczenia dla najbardziej popularnych ataków jak wstrzykiwanie SQL czy łamanie haseł.

source: Fig.1 Django administrator panel, facilitating the management of the database.
pl: Rys.1 Panel administratora Django, ułatwiający zarządzanie bazą danych.

source: The biggest advantage affecting the popularity of this framework is a large community focused around it which leads to the creation of extensive documentation and many guides. Also the most common problems related to the use of this framework have been very well explained on the internet. There are also annual conferences for programmers, such as DjangoCon, where there is an exchange of knowledge between people who create the framework and its users.
pl: Największą zaletą wpływająca na popularność tego frameworka jest duża społeczność skupiona wokół niego co prowadzi do tworzenia rozbudowanej dokumentacji oraz wielu poradników. Również najpowszechniej występujące problemy związane z użytkowaniem tego frameworka zostały bardzo dobrze wyjaśnione w internecie. Organizowane są również coroczne konfernecje dla programistów jak na przykład DjangoCon na których następuje wymiana wiedzy pomiędzy osobami zarówno tworzącymi sam framework jak jego użytkownikami.

source: Make request to external API (https://openweathermap.org) to get weather forecast for Katowice and return response
pl: Wyślij żądanie do zewnętrznego API (https://openweathermap.org) w celu pobrania prognozy pogody dla Katowic i zwróć jako odpowiedź

source: Make Request
pl: Wyślij żądanie

source: Flask is a free open source micro-framework created in 2004. Flask is classified as micro-framework, it doesn't need any special tools or libraries to launch.
pl: Flask jest to darmowy otwarto źródłowy mikro-framework powstały w 2004 roku. Flask jest klasyfikowany jako mikro-framework z uwagi na to, że do uruchomienia nie wymaga żadnych specjalnych narzędzi ani bibliotek.

source: In 2012 one of the biggest social networks for posting pictures Pinterest moved it's API which was originally based on Django to Flask. Pinterest can manage to serve over 10 billions HTTP requests per day only with this software.
pl: W 2012 roku jeden z największych serwisów społecznościowych na których można umieszczać zdjęcia Pinterest przeniósł swoje API oparte o Django na framework Flask. Serwis Pinterest jest w stanie obsłużyć ponad 10 miliardów żądań HTTP tylko z użyciem tego oprogramowania.

source: In its basic version, it does not have as many functions as the previously described Django framework. It does not contain a layer responsible for communication with the database or validation of forms. All such functions are offered as extensions to its basic version. The extensions themselves are also developed by the community and people who are not directly in the team of programmers responsible for creating this software.
pl: W swojej podstawowej wersji nie posiada on tylu funkcji co opisany wcześniej framework Django. Nie zawiera w sobie warstwy odpowiedzialnej za komunikację z bazą danych lub walidację formularzy. Wszystkie tego typu funkcje oferowane są jako rozszerzenia do jego podstawowej wersji. Same rozszerzenia są również rozwijane przez społeczność oraz osoby nie będące bezpośrednio w zespole programistów odpowiedzialnych za tworzenie tego oprogramowania.

source: Extensions include, among others:
pl: Rozszerzenia zawierają między innymi:

source: ORM to communicate with database
pl: ORM do komunikacji z bazą danych

source: Tools for making database migrations
pl: Narzędzia wspierające wykonywanie migracji bazy danych

source: Tools supporting different authorization methods
pl: Narzędzia wspierające różne metody autentykacji

source: Form validation
pl: Walidację formularzy

source: The main advantage of the Flask framework is its great freedom in configuration, which translates into the ability to adapt it to the specificity of the problem that developers want to solve. It does not impose the use of specific tools provided with the distribution and apart from providing the basic version with the most necessary functionalities such as rendering HTML pages or routing URLs.
pl: Główną zaletą frameworka Flask jest jego duża dowolność w konfiguracji, co przekłada się na możliwość dostosowywania go do specyfiki problemu, który chcą rozwiązać programiści. Nie narzuca on korzystania ze specyficznych narzędzi dostarczanych wraz z dystrybucją a poza zapewnieniem w podstawowej wersji najbardziej niezbędnych funkcjonalności jak renderowanie stron HTML czy routing adresów URL.

source: In it's basic version includes:
pl: W swojej podstawowej wersji zawiera:

source: Server and debugger
pl: Serwer oraz debugger

source: Support for unit tests
pl: Wsparcie dla testów jednostkowych

source: HTML templating language Jinja2
pl: Język do generowania formularzy HTML Jinja2

source: URL dispatcheer
pl: Dyspozytor URL

source: An example of how little code is needed to create a fully-fledged web server with the use of this software that is capable of returning HTTP responses after indicating a specific URL is the code shown below in Figure 1.
pl: Przykładem tego jak niewiele kodu jest potrzebne do tego aby z użyciem tego oprogramowania stworzyć pełnoprawny serwer internetowy zdolny do zwracania odpowiedzi HTTP po wskazaniu konkretnego adresu URL jest kod widoczny poniżej na Rys 1.

source: Fig 1. Sample web server created with Flask.
pl: Rys 1. Przykładowy serwer stworzony z użyciem Flask

source: Benchmark Python Web Frameworks
pl: Porównaj Frameworki Web dla języka Python

source: On this website you can compare 3 most popular python web frameworks in following tests.
pl: Na tej stronie możesz porównać 3 najpopularniesznie frameworki web dla języka python w następujących testach.

source: Rendering HTML template
pl: Renderowanie szablonu HTML

source: Render same text in HTML template 100, 1000 or 10000 times.
pl: Wyrenderuj ten sam tekst w szablonie HTML 100, 1000 lub 10000 razy.

source: Insert data to database
pl: Wprowadzanie danych do bazy danych

source: Insert sample data to database with each framework's ORM for 10, 50 or 100 records.
pl: Wprowadź testowe dane do bazy danych z użyciem ORM danego frameworka dla 10, 50 lub 100 rekordów.

source: External API call
pl: Wywołanie zewnętrznego API

source: Make request to OpenWeather API to collect data and return as response.
pl: Wyślij żądanie do zewnętrznego API (https://openweathermap.org) w celu pobrania prognozy pogody dla Katowic i zwróć jako odpowiedź.

source: Collect object from database and return as JSON response.
pl: Serializuj przykładowy obiekt JSON i zwróć jako odpowiedź.

source: Flask is a free open-source micro-framework created in 2004.
pl: Flask jest darmowym otwarto źródłowym mikro-frameworkiem stworzonym w 2004 roku.

source: Learn more
pl: Dowiedz się więcej

source: Django is a free open-source framework for desigining complex web services created in 2005.
pl: Django jest darmowym otwarto źródłowym frameworkiem przeznaczonym do tworzenia złozonych serwisów internetowych stworzonym w 2005 roku.

source: Pyramid is a free open-source micro-framework created in 2008.
pl: Pyramid jest darmowym otwarto źródłowym mikro-frameworkiem stworzonym w 2008 roku.

source: Inserting objects to database
pl: Wprowadzanie obiektów do bazy danych

source: Sample Object:
pl: Przykładowy obiekt:

source: How many times?
pl: Ile razy?

source: Insert
pl: Wprowadź

source: Pyramid is a free opensource micro-framework created in 2008. Developers who worked on this software were inspired by Django web framework.
pl: Pyramid jest to darmowy otwartoźródłowy mikro-framework stworzony w 2008 roku. Programiści pracujący nad produkcją tego oprogramowania inspirowali się Django.

source: In basic version it provides only basic functionalitites similar to Flask. It can communicate with relational databases using SQLAlchemy or with NoSQL databases for instance InfluxDB or CouchDB
pl: W swojej podstawowej wersji podobnie jak Flask udostępnia jedynie najważniejsze funkcjonalności. Może onkomunikować się z relacyjnymi bazami danych za pomocą SQLAlchemy lub z bazami NoSQL jak na przykład InfluxDB lub CouchDB

source: Like flask it has support for extensions made by community.
pl: Podobnie jak Flask posiada on wsparcie dla rozszerzeń tworzonych przez społeczność.

source: Basic view which is full HTTP server returning valid response when request is sent to desirable address can be seen on Fig 1.
pl: Podstawowy widok będący pełnoprawnym serwerem HTTP zwracającym poprawną odpowiedź regując na żądanie wysłane pod wskazany adres widoczne jest na Rys 1.

source: Fig 1. Basic web server created with Pyramid
pl: Rys 1. Przykładowy serwer stworzony z użyciem Pyramid

source: Rendering same paragraph specified number of times
pl: Renderowanie tego samego paragrafu wybraną liczbę razy

source: Basic Text
pl: Przykładowy tekst

source: Render
pl: Renderuj

source: 100 elements
pl: 100 elementów

source: 1000 elements
pl: 1000 elementów

source: 10000 elements
pl: 10000 elementów

source: Serialize sample JSON object and return as response
pl: Serializuj przykładowy obiekt JSON i zwróć jako odpowiedź
